# -*- coding:utf-8 -*-
# 快玩
num_list1 = ["宽厚仁德", "权智英略", "求贤若渴", "志得意满", "指囷相赠", "弘毅宽厚", "审时度势", "引虎自卫", "尾大不掉", "外强中干", "百战百胜", "唇亡齿寒", "相敬如宾",
             "鸠占鹊巢", "厉兵秣马", "居安思危", "从善如流", "平步青云", "怙恶不悛", "进退维谷", "分庭抗礼", "同仇敌忾", "四面楚歌", "魑魅魍魉", "甲第连天", "成事在天",
             "短兵相接", "处之泰然", "海阔天空", "力排众议", "横槊赋诗", "独步一时", "将遇良才", "青红皂白", "兵贵神速", "相见恨晚", "笔扫千军", "苍山负雪", "气骄志满",
             "声张势厉", "关山雪满", "白马之围", "大战吕布", "凤凰涅磐", "跃马檀溪", "借刀杀人", "披肝沥胆", "刀枪林立", "擒贼擒王", "万箭齐发", "指点江山", "瞒天过海",
             "武圣关羽", "人喊马嘶", "惜客好义", "七步成诗", "步步为营", "片甲不留", "金玉良缘", "皆大欢喜", "两小无猜", "傲睨得志", "隐介藏形", "假传圣旨", "民生凋敝",
             "器宇轩昂", "唯才是举", "发号施令", "超世之杰", "忠肝义胆", "刚愎自用", "苦心经营", "梦中杀人", "自负不凡", "鼓角齐鸣", "网开一面", "大江东去", "宁静致远",
             "才兼文武", "惊才风逸", "智勇双全", "忠心在汉", "水淹七军", "事必躬亲", "精诚所至", "韬晦待时", "矢志不移", "大义凛然", "化险为夷", "妙算神机", "面授机宜",
             "声东击西", "打草惊蛇", "笑里藏刀", "调虎离山", "无中生有", "李代桃僵", "桃园豪杰", "鹰击长空", "偷梁换柱", "抛砖引玉", "暗渡陈仓", "火烧新野", "携民渡江",
             "坚壁清野", "七步成皇", "羽扇藏锋", "四世三公", "下笔成章", "千秋霸业", "初出茅庐", "刮目相待", "呼风唤雨", "位极人臣", "故弄玄虚", "明眸善睐", "飞龙在天",
             "孔融让梨", "辕门射戟", "偷天换日", "血战到底", "德厚流光", "杞人忧天", "沧笙踏歌", "宝刀未老", "卧龙出渊", "运筹帷幄", "马踏天下", "束兵秣马", "三战新野",
             "万古云霄", "二乔争艳", "云涌风飞", "赤壁怀古", "孙家虎女", "千年之恋", "枭止连环", "见龙卸甲", "勇冠三军", "汉中之战", "守株待兔", "横扫八荒", "决一死战",
             "忠贞不渝", "元龙高卧", "灯烛辉煌", "案兵束甲", "负薪救火", "大获全胜", "肺腑之言", "寡不敌众", "鹤发童颜", "一臂之力", "虎入羊群", "五谷丰登", "单刀赴会",
             "顿开茅塞", "吴下阿蒙", "鬼斧神工", "马踏飞燕", "余音绕梁", "东山再起", "和光同尘", "一丝不苟", "朝秦暮楚", "如虎添翼", "风月无边", "九关虎豹", "本末倒置",
             "秋风落叶", "无价之宝", "逝者如斯", "咫尺天涯", "宠辱不惊", "四战之国", "同舟敌国", "功垂千古", "屯粮积草", "老成练达", "远见卓识", "败军之将", "枭雄曹操",
             "反间之计", "对答如流", "反老还童", "海枯石烂", "以寡敌众", "力拔山河", "剑戟森森", "诸葛孔明", "淡泊明志", "绝处逢生", "一石二鸟", "青天白日", "心旷神怡",
             "班门弄斧", "开源节流", "王侯将相", "诸葛镶星", "惊弓之鸟", "望尘莫及", "鞭辟入里", "沉鱼落雁", "点石成金", "衣冠楚楚", "自强不息", "左右逢源", "工于心计",
             "群雄竞起", "铁索连环", "忧国奉公", "天府之国", "天香国色", "一往无前", "锦上添花", "峰回路转", "新亭对泣", "蔚然成风", "众志成城", "珠联璧合", "火烧连营",
             "招兵买马", "一事无成", "金刚怒目", "登峰造极", "默换潜移", "黄尘清水", "魂飞魄扬", "怀珠抱玉", "缘木求鱼", "白龙鱼服", "多难兴邦", "三足鼎立", "亭亭玉立",
             "朝升暮合", "不一而足", "做张做势", "厚积薄发", "作舍道边", "长绳系日", "作茧自缚", "作壁上观", "形影相吊", "流星箭雨", "趋之若鹜", "江云渭树", "大彻大悟",
             "竹马之交", "卓绝千古", "措手不及", "孔孟之道", "孟德献刀", "奸绝曹操", "智取陈仓", "霸气凛然", "画饼充饥", "入主西川", "如嚼鸡肋", "金戈铁马", "六出祁山",
             "爱屋及乌", "威震乾坤", "计定天下", "春锁二乔", "孙吴雄心", "三国崛起", "火烧洛阳", "南蛮入侵", "乐不思蜀", "中原逐鹿", "龙争虎斗", "胜者为王", "瑜亮争辉",
             "魏武霸业", "平湖秋月", "齐心戮力", "战神吕布", "流芳百世", "心怀叵测", "三分天下", "有机可乘", "品头论足", "强弩之末", "围魏救赵", "任贤使能", "一身是胆",
             "无名小卒", "白袍将军", "刀枪剑戟", "安身乐业", "兵无常形", "四海飘零", "无计可施", "虎踞鲸吞", "放鱼入海", "东冲西突", "丹凤朝阳", "奋发图强", "柔情蜜意",
             "英雄豪杰", "直冲云霄", "势如破竹", "天降大任", "刚正不阿", "虎踞龙盘", "顾曲周郎", "大器晚成", "画戟赤兔", "披荆斩棘", "约法三章", "世外桃源", "鞠躬尽瘁",
             "侠骨柔情", "刮骨疗毒", "单骑救主", "割发代首", "欲擒故纵", "辕门射戢", "伯仲之间", "敝帚千金", "桃园结义", "步罡踏斗", "器宇不凡", "七步成章", "瑶琴三尺",
             "决战千里", "弓折刀尽", "金蝉脱壳", "诸侯并起", "三让徐州", "草木皆兵", "羽扇纶巾", "势不可当", "天下为一", "终极神将", "赤膊上阵", "虎落平川", "威风凛凛",
             "张灯结彩", "赤壁鏖兵", "笑傲风月", "为国为民", "望尘不及", "三顾茅庐", "危言正色", "威凤一羽", "外合里应", "为法自弊", "伟绩丰功", "外柔内刚", "万里鹏程",
             "瓦解冰泮", "万人之敌", "惟力是视", "官渡之战", "万代千秋", "枉费唇舌", "亡国灭种", "可见一斑", "望梅止渴", "触目惊心", "不出所料", "长林丰草", "奇花异卉",
             "金枝玉叶", "熙熙攘攘", "雾里看花", "水木清华", "花花世界", "头晕目眩", "牛郎织女", "三人成虎", "指鹿为马", "狐假虎威", "叶公好龙", "安身之地", "劝百讽一",
             "傲慢少礼", "班师回朝", "宝刀不老", "不成体统", "残暴不仁", "尺寸可取", "懊悔无及", "饱学之士", "村野匹夫", "大仁大义", "以儆效尤", "得而复失", "苍生涂炭",
             "大计小用", "大展经纶", "倍道而进", "秉烛待旦", "费力劳心", "恩荣并济", "反败为胜", "抵足而眠", "青山不老", "恩怨分明", "官轻势微", "光阴荏苒", "鬼神不测",
             "荒淫无耻", "开基立业", "空城计", "举善荐贤", "虎体熊腰", "宽以待人", "钟鸣鼎食", "老弱残兵", "怒目而视", "能征惯战", "龙肝凤髓", "情同骨肉", "曲意逢迎",
             "声威大震", "尸横遍野", "漫山遍野", "身不由己", "千军万马", "神鬼莫测", "忍辱偷生", "束手待毙", "金波玉液", "择主而事", "开基创业", "奋武扬威", "别作良图",
             "坐视不救", "反覆无常", "风云再起", "怒气填胸", "以私废公", "倚势凌人", "兵精粮足", "同心合胆", "狐性多疑", "日理万机", "临军对阵", "横行无忌", "膏粱子弟",
             "火烧赤壁", "知遇之恩", "无事生非", "两相情愿", "一言不发", "有声有色", "单刀直入", "三气周瑜", "隔岸观火", "恩威并重", "月明星稀", "对酒当歌", "义薄云天",
             "文思泉涌", "廊庙之器", "人生如寄", "插翅难逃", "情非得已", "生财有道", "无地自容", "落叶归根", "滔滔不绝", "永无止境", "夷陵之战", "六道轮回", "破釜沉舟",
             "万里长城", "亡羊补牢", "郑人买履", "厚德载物", "养生之道", "日日夜夜", "铁杵成针", "四面楚歌", "九伐中原", "凿壁偷光", "争先恐后", "不可胜数", "志在四方",
             "补天浴日", "精忠报国", "价值连城", "任劳任怨", "退避三舍", "天经地义", "水掩七军", "炼石补天", "负荆请罪", "行将就木", "白手起家", "韦编三绝", "露水夫妻",
             "一丘之貉", "杯水车薪", "心猿意马", "兄弟阋墙", "古城相会", "按图索骥", "形影不离", "图穷匕见", "一蹴而就", "望洋兴叹", "垂帘听政", "投鼠忌器", "安步当车",
             "目无全牛", "若即若离", "过关斩将", "今非昔比", "愚公移山", "小家碧玉", "毛遂自荐", "门可罗雀", "流星赶月", "腾云驾雾", "火眼金睛", "逼上梁山", "指手画脚",
             "十面埋伏", "天诛地灭", "四平八稳", "情投意合", "穿针引线", "龙生九子", "万箭穿心", "福星高照", "随遇而安", "雷霆万钧", "不法之徒", "以逸待劳", "龙断可登",
             "期月有成", "景公求雨", "朝盈夕虚", "权宜之计", "木雁之间", "知恩图报", "不遗余力", "天下英雄", "旁敲侧击", "上兵伐谋", "妄自菲薄", "出言不逊", "以碫投卵",
             "白鱼入舟", "精细入微", "精兵猛将", "舍我其谁", "虎啸风生", "我武惟扬", "元龙豪气", "经世济民", "舌战群儒", "封金挂印", "百万雄师", "半筹莫展", "松形鹤骨",
             "魂亡胆落", "背若芒刺", "马革裹尸", "华容让道", "一团和气", "长年累月", "太平盛世", "走马观花", "南来北往", "一五一十", "白手起家", "满面春风", "乐极生悲",
             "语重心长", "不由自主", "落地生根", "五花八门", "皓月千里", "火烧眉毛", "春风化雨", "十指连心", "古往今来", "落花流水", "古今中外", "风和日丽", "旁若无人",
             "对簿公堂", "半推半就", "汉室江山", "卜昼卜夜", "浮光掠影", "汗牛充栋", "炫服靓妆", "不丰不杀", "荒诞不经", "见贤思齐", "忍俊不禁", "色厉内荏", "萍水相逢",
             "诸葛连弩", "求全责备", "醍醐灌顶", "旭日初升", "红男绿女", "安身立命", "济济多士", "哀梨蒸食", "哀感顽艳", "匪夷所思", "蔼然可亲", "十面埋伏", "爱民如子",
             "安常处顺", "爱日惜力", "安贫乐道", "安忍无亲", "安如泰山", "黯然伤神", "按名责实", "张灯结彩", "光阴荏苒", "远交近攻", "威风凛凛", "气宇轩昂", "胸怀大志",
             "器宇轩昂", "诡计多端", "养精蓄锐", "反戈一击", "孔孟之道", "大吉大利", "虚虚实实", "背水一战", "赤膊上阵", "锦囊妙计", "宽以待人", "旷世逸才", "削铁如泥",
             "力排众议", "器宇不凡", "反败为胜", "横行无忌", "龙肝凤髓", "格物致知", "仁义之师", "星月交辉", "柔能克刚", "倍道而进", "饱学之士", "击鼓鸣金", "荒淫无道",
             "笑傲风月", "傲睨自若", "休声美誉", "傲睨万物", "鸠夺鹊巢", "长驱直进", "傲贤慢士", "泼油救火", "割恩断义", "蠹政病民", "佯输诈败", "鼎足之势", "旦夕之危",
             "如饮醇醪", "王道兴隆", "锦囊妙计", "髀肉复生", "恣意妄为", "百举百捷", "兵以诈立", "两虎共斗", "三折其肱", "碧瓦朱甍", "一登龙门", " 拔群出类", "秕者先行",
             "千里袭人", "比屋可诛", "悲欢聚散", "杯圈之思", "抱素怀朴", "南阳三葛", "苞藏祸心", "太公钓鱼", "问一得三", " 刀山剑林", "子孙后辈", "血染征袍", "子继父业",
             "八抬大轿", "于心不忍", "人中豪杰", "兀兀穷年", "削发为僧", "有翅难飞", "一家之主", "小康人家", "以势压人", "华夏天威", " 犹豫不定", "铁腕人物", "心里有底",
             "招风揽火", "志大才疏", "整军经武", "仗马寒蝉", "有福同享", "运用自如", "张皇失措", "蜀汉三杰", "易如反掌", "直眉瞪眼", "众口铄金", "庸医杀人", "月下老人",
             "鱼大水小", "转危为安", "贼人胆虚", "方外之人", "燕雀处屋", "九州称雄", "项庄舞剑", "闯荡江湖", "惜墨如金", "荆天棘地", "星落云散", "破镜重圆", "稀世之宝",
             "鬼哭狼嚎", "举国上下", "饱经忧患", "号令天下", "索然寡味", "豆剖瓜分", "衣锦还乡", "急中生智", "万紫千红", "微乎其微", "欢呼雀跃", "呆若木鸡", "一身正气",
             "镇定自若", "负重致远", "仰不愧天", "和风细雨", "鹏程万里", "百花齐放", "春雨如油", "一箭双雕", "临危不惧", "堂堂正正", "安然无恙", "爱鹤失众", "赤壁之战",
             "白头如新", "拔苗助长", "车载斗量", "百丈竿头", "才占八斗", "当局者迷", "大放厥词", "各自为政", "防微杜渐", "飞将数奇", "气吞山河", "东窗事发", "过门不入",
             "城狐社鼠", "挨肩擦膀", "囊中羞涩", "霸王之资", "露头露脸", "翻手为云", "嚣浮轻巧", "懵头转向", "君临天下", "百步穿杨", "鹰派人物", "瞬息千变", "激流勇进",
             "擎天玉柱", "横眉竖目", "疑云满腹", "聪明能干", "德高望尊", "壮志凌云", "旗开得胜", "举世无双", "胸怀大志", "战神降临", "先礼后兵", "百家争鸣", "鸿鹄之志",
             "定鼎九州", "五子良将", "如鱼得水", "大智若愚", "风华正茂""大禹治水", "片甲不存", "忠顺勤劳", "掌上观文", "上知天文", "下知地理", "文韬武略", "缓兵之计",
             "焚香礼拜"]

# num_list1 = [1,2,3,4]
###6332,16333,16334,16341,16351,16353,16361,16361,16363,16363,16371,16373,16381,16383,16384,16385,16387,16389,16391,16393,16395,16401,16402,16403,16404,16405,16406,16407,16408,16409,16410,16411,16412,16413,16414,16415,16416,16417,16418,16419,16420,16421,16422,16423,16424,16425,16427,16429,16431,16433,16435,16437,16439,16451,16452,16471,16472,16473,16474,16475,16477]
# 米趣玩
num_list2 = ["水淹七军", "望梅止渴", "三国归晋", "黄忠请战", "单骑救主", "坚壁清野", "神策诸葛", "擒贼擒王", "混水摸鱼", "桃园豪杰", "吴魏之争", "白马之围", "携民渡江",
             "跃马檀溪", "隆中对策", "铁索连环", "义薄云天", "风华绝代", "智勇双全", "一飞冲天", "千秋霸业", "御龙天下", "大战吕布", "天下王者", "诸侯并起", "金蝉脱壳",
             "如虎添翼", "偷梁换柱", "木牛流马", "火烧新野", "威风凛凛", "釜底抽薪", "神武诸葛", "仁德天下", "天下皆知", "器宇轩昂", "逐鹿中原", "白衣渡江", "卧龙吊孝",
             "大江东去", "鸠占鹊巢", "鹰撮霆击", "夭矫不群", "仙落凡尘", "回眸一笑", "唇亡齿寒", "外强中干", "居安思危", "含商咀徵", "国色天香", "余音绕梁", "山呼海啸",
             "推心置腹", "甲第连天", "三国鼎立", "降龙伏虎", "踏上征途", "应龙现身", "号令天下", "隔岸观火", "群英聚会", "南蛮入侵", "志在千里", "武圣关羽", "鼎足三分",
             "见龙卸甲", "无中生有", "吴下阿蒙", "草船借箭", "赤壁之战", "指点江山", "纸上谈兵", "关山雪满", "气盛言宜", "横扫千军", "势如破竹", "方天画戟 ", "抛砖引玉",
             "浩然正气", "怙恶不悛", "劝百讽一", "鹰击长空", "约法三章", "卧薪尝胆", "耳提面命", "万里长风", "四面楚歌", "护国神器", "进退维谷", "如饮醇醪", "髀肉复生",
             "集思广益", "三顾茅庐", "虎踞龙盘", "才高八斗", "超群绝伦", "顾曲周郎", "鼎足之势", "万夫莫当 ", "同符合契", "名不虚传", "危在旦夕", "作奸犯科", "探囊取物",
             "廊庙之器", "卧龙出渊", "运筹帷幄", "马踏天下", "束兵秣马", "江湖奇遇", "乱世王者", "七进七出", "赤壁怀古", "寡不敌众", "桃园结义", "刮目相待", "文思泉涌",
             "恩威并重", "对酒当歌", "人生如寄", "大获全胜", "英雄史诗 ", "七步之才", "运筹决算", "扬武耀威", "揎拳裸袖", "神鬼难测", "佯输诈败", "鸣金收军", "大计小用",
             "割恩断义", "指南攻北", "百战不殆", "同心合胆", "虎体熊腰", "老成练达", "屯粮积草", "半筹莫展", "天崩地塌", "三强会战", "临军对阵", "剑戟森森", "虎落平川",
             "力战群雄", "出师未捷", "巧借东风", "火烧赤壁", "妙算神机", "用行舍藏", "锦囊妙计", "豕突狼奔", "青梅煮酒", "忠心在汉", "仰不愧天", "三国无双", "手不释卷",
             "借刀杀人", "海阔天空", "卧虎藏龙", "面授机宜", "力排众议", "相见恨晚", "处之泰然", "知恩图报", "短兵相接", "云涌风飞", "成事在天", "横槊赋诗", "独步一时",
             "知遇之恩", "青红皂白", "兵贵神速", "一夫当关", "行云流水", "鹰击长空", "画地为牢", "气贯长虹", "阳春白雪", "斗转星移", "神武诸葛", "枭雄曹操", "兵荒马乱",
             "后继无人", "反客为主", "工于心计", "忧国奉公", "天府之国", "星火燎原", "海枯石烂", "黄粱一梦", " 横眉吐气", "宁静致远", "经天纬地", "民生凋敝", "首屈一指",
             "谋事在人", "顾盼自雄", "事必躬亲", "舍我其谁", "位高权重", "自负不凡", "超世之杰", "唯才是举", "粗中有细", "宽厚仁德", "隐介藏形", "引虎自卫", "把薪助火",
             "远见卓识", "偷天换日", "割发代首", "才兼文武", "略施小计", "韬晦待时", "空城妙计", "以寡敌众", "弓折刀尽", "流急水深", "鼓角齐鸣", "触目惊心", "惊天动地",
             "功成名就", "片甲不存", "三人成虎", "庖丁解牛", "侠肝义胆", "单刀赴会", "声色犬马", "单枪匹马", "战神吕布", "江东赴会", "四世三公", "石破天惊", "远交近攻",
             "诸葛连弩", "蜀汉三杰", "华夏天威", "苦心经营", "人喊马嘶", "梦中杀人", "步步为营", "七步成诗", "前程似梦", "不遗余力", "出言不逊", "片甲不留", "金玉良缘",
             "假传圣旨", "两小无猜", "勇猛无敌", "发号施令", "傲睨得志", "风云再起", "背若芒刺", "过关斩将", "水掩七军", "秋风扫叶", "豪杰聚义", "古城相会", "九伐中原",
             "瑜亮争辉", "气宇轩昂", "云中白鹤", "胜者为王", "无名小卒", "一身是胆", "魏武霸业", "品头论足", "怀珠抱玉", "多难兴邦", "缘木求鱼", "不一而足", "做张做势",
             "白龙鱼服", "势不可当", "投鼠忌器", "作壁上观", "长绳系日", "作茧自缚", "趋之若鹜", "亭亭玉立", "厚积薄发", "形影相吊", "作舍道边", "杏雨梨云", "狂涛巨浪",
             "杯水车薪", "退避三舍", "囊萤映雪", "君子好逑", "自怨自艾", "患得患失", "乘风破浪", "飞黄腾达", "白马非马", "入木三分", "骄兵之计", "枪林弹雨", "见贤思齐",
             "遇人不淑", "爱屋及乌", "未雨绸缪", "南辕北辙", "龙争虎斗", "舌战群雄", "昙花一现", "百鸟朝凤", "龙腾四海", "千钧一发", "负荆请罪", "镜花水月", "大禹治水",
             "铁石心肠", "春华秋实", "浮生若梦", "战神降临", "口是心非", "锦上添花", "月影寒刀", "鹤立鸡群", "一往无前", "新亭对泣", "移花接木", "一事无成", "风猛火烈",
             "众志成城", "周郎赤壁", "灰飞烟灭", "登峰造极", "铁血皇城", "拔山盖世", "物极必反", "珠联璧合", "绝处逢生", "王侯将相", "皆大欢喜", "景公求雨", "权宜之计",
             "朝盈夕虚", "期月有成", "木雁之间", "战龙在野", "默换潜移", "龙断可登", "黄尘清水", "朝升暮合", "左思右想", "大彻大悟", "江云渭树", "竹马之交", "卓绝千古",
             "气克斗牛", "凤舞九天", "激流勇进", "嫣然而笑", "德高望尊", "求贤若渴", "上知天文", "下知地理", "缓兵之计", "忠顺勤劳", "掌上观文", "志得意满", "灯烛辉煌",
             "弘毅宽厚", "审时度势", "文韬武略", "指囷相赠", "志大才疏", "青山不老", "虚虚实实", "心术不正", "孟德献刀", "画饼充饥", "击鼓鸣金", "如嚼鸡肋", "入主西川",
             "奸绝曹操", "万代千秋", "万里鹏程", "危言正色", "望尘不及", "威凤一羽", "瓦解冰泮", "虚废词说", "龙肝凤髓", "反覆无常", "苍生涂炭", "以卵敌石", "四海飘零",
             "择主而事", "以私废公", "村野匹夫", "略无忌惮", "勿怠勿忘", "口似悬河", "恩荣并济", "能征惯战", "自有公论", "尺寸可取", "拔山扛鼎", "高屋建瓴", "登堂入室",
             "饮鸩止渴", "赤子之心", "美轮美奂", "左道旁门", "八仙过海", "花容月貌", "岁寒三友", "争分夺秒", "小家碧玉", "纵横捭阖", "乐不思蜀", "鬼迷心窍", "迫在眉睫",
             "风流韵事", "峰回路转", "碧血丹心", "移花接木", "一网打尽", "柳暗花明", "蔚然成风", "马首是瞻", "求全责备", "天罗地网", "心有余悸", "绿树成荫", "冠冕堂皇",
             "肝脑涂地", "连锁反应", "金刚怒目", "开门见山", "历历在目", "霸王别姬", "兵临城下", "逍遥法外", "万箭穿心", "四海一家", "精卫填海", "身先士卒", "铜雀春深",
             "穿针引线", "永无止境", "日日夜夜", "万家灯火", "福星高照", "国士无双", "棋逢对手", "叶公好龙", "风花雪月", "差强人意", "浴血奋战", "唯我独尊", "邯郸学步",
             "龙凤呈祥", "再接再厉", "海市蜃楼", "鳞次栉比", "掩耳盗铃", "莫衷一是", "凿壁偷光", "而立之年", "水滴石穿", "诸子百家", "暴殄天物", "如火如荼", "大智若愚",
             "松形鹤骨", "魂亡胆落", "落地生根", "马革裹尸", "华容让道", "一团和气", "百炼成钢", "长年累月", "走马观花", "南来北往", "一五一十", "白手起家", "满面春风",
             "乐极生悲", "语重心长", "不由自主", "露水夫妻", "铁面无私", "一丘之貉", "按图索骥", "图穷匕见", "一蹴而就", "安步当车", "形影不离", "兄弟阋墙", "心猿意马",
             "毛遂自荐", "逼上梁山", "火眼金睛", "指手画脚", "天诛地灭", "四平八稳", "情投意合", "胸怀大志", "赤膊上阵", "旷世逸才", "削铁如泥", "曲意逢迎", "横行无忌",
             "细水长流", "宽以待人", "大吉大利", "诡计多端", "养精蓄锐", "反戈一击", "先礼后兵", "锦囊妙计", "赤膊上阵", "曲意逢迎", "嘴硬心软", "三头六臂", "两厢情愿",
             "一心为公", "以长攻短", " 遮风挡雨", " 自我欣赏", " 踏步不前", " 占山为王", " 有功之臣", " 验明正身", " 宿将旧卒", "大名鼎鼎", " 纸笔喉舌", " 一分一厘",
             " 一登龙门", " 倔头倔脑", "兵以诈立", "两虎共斗", "问一得三", "削发为僧", "一叶知秋", "太公钓鱼", "同生共死", "刀山剑林", "子继父业", "杯圈之思", "插翅难逃",
             "人中豪杰", "碧瓦朱甍", "以势压人", "苞藏祸心", "抱素怀朴", "虎头蛇尾", "万敌不侵", "金戈铁马", "发愤图强", "望子成龙", "望穿秋水", "无精嗒彩", "闻宠若惊",
             "无情无彩", "开眉展眼", "乐极悲生", "惊喜欲狂", "大喜若狂", "力拔山河", "心痒难挠", "一嚬一笑", "抚掌大笑", "人莫予毒", "整军经武", "鸿鹄之志", "败走麦城",
             "破镜重圆", "豆剖瓜分", "闯荡江湖", "勇冠三军", "急中生智", "易如反掌", "百花齐放", "转危为安", "胆战心惊", "举国上下", "笑傲江湖", "镇定自若", "呆若木鸡",
             "白商素节", "气冲霄汉", "暗送秋波", "明察秋毫", "落叶知秋", "秋毫不犯", "蒲柳之质", "兵精粮足", "宝刀未老", "别来无恙", "飞砂走石", "兵强马壮", "大智大勇",
             "饱学之士", "齐心戮力", "勃然大怒", "犯颜苦谏", "飞蛾扑火", "口出不逊", "千辛万苦", "改朝换代", "生龙活虎", "高瞻远瞩", "百战百胜", "察言观色", "调兵遣将",
             "道听途说", "螳臂挡车", "粉身碎骨", "囊中羞涩", "巍然挺立", "嚣浮轻巧", "瞬息千变", "焚书坑儒", "龙骧虎步", "煮豆燃萁", "完璧归赵", "讳疾忌医", "指鹿为马",
             "宝刀不老", "胸有成竹", "一字千金", "江郎才尽", "千金买骨", "悬梁刺股", "战无不胜", "孺子可教", "高山流水", "惊弓之鸟", "投笔从戎", "平易近人", "千金一笑",
             "道不拾遗", "志在四方", "望洋兴叹", "招风揽火", "赴汤蹈火 ", "方外之人", "燕雀处屋", "荆天棘地", "惜墨如金", "直眉瞪眼", "鱼大水小", "庸医杀人", "张皇失措",
             "众口铄金", "万象更新", "骁勇善战", "亡羊补牢", "春意盎然", "鸟语花香", "眼高手低", "袖手傍观", "蜻蜓点水", "黄雀在后", "七拼八凑", "抱薪救火", "手足情深",
             "英姿焕发", "龙吟九州", "刻舟求剑", "耳闻目睹", "程门立雪", "左顾右盼", "硕学通儒", "倒置干戈", "松柏寒盟", "量己审分", "圭璋特达", "违世绝俗", "孔孟之道",
             "出何典记", "勇猛果敢", "亘古通今", "跌荡不羁", "照萤映雪", "杞梓之林", "还淳反素", "含霜履雪", "三榜定案", "水木清华", "成败得失", "天涯海角", "倾国倾城",
             "纸醉金迷", "汗牛充栋", "白驹过隙", "刮骨疗毒", "执鞭随镫", "四海飘零", "柔能克刚", "开基创业", "黩武穷兵", "军令如山", "极天际地", "黄口孺子", "峨冠博带",
             "挨肩擦膀", "霸王之资", "露头露脸", "翻手为云", "懵头转向", "擎天玉柱", "孑然一身", "聪明能干", "显而易见", "两面三刀", "万众一心", "志同道合", "卓尔不群",
             "川流不息", "刨根问底", "勾心斗角", "母仪天下", "暗度陈仓", "凌云壮志", "横行霸道", "恣行无忌", "目空一切", "倚强凌弱", "飞扬跋扈", "誉满天下", "斩将搴旗",
             "功标青史", "轻世傲物", "如饮醇醪", "桀骜不驯", "耀武扬威", "声威素著", "如雷贯耳", "大义凛然", "招兵买马", "五谷丰登", "忠贞不渝", "博古通今", "功垂千古",
             "幕天席地", "周郎顾曲", "凛冬将至", "声东击西", "打草惊蛇", "李代桃僵", "万古云霄", "枭止连环", "三战新野", "孙家虎女", "鹰视狼顾", "跃马弯弓", "智取三军",
             "军师联盟", "驱虎吞狼", "暗藏杀机", "只掌遮天", "卧龙凤雏", "美人离间", "乱世枭雄", "败走华容", "空城绝唱", "王者天下", "止战之殇", "冲冠一怒", "王者归来",
             "朝辞白帝", "一战倾城", "烽火围城", "纵横四海", "霸道称王", "天地乾坤", "天照之华", "相得益彰", "盛世风云", "鸣凤在野", "瀚海玄英", "浩天长歌", "黑暗之魂",
             "云海征帆", "如日中天", "怒海狂涛", "言简意赅", "任重道远", "吞食天地", "笑傲风月", "强词夺理", "物伤其类", "叱咤风云", "天高地厚", "干将莫邪", "孟母三迁",
             "天马行空", "风和日丽", "买椟还珠", "血战到底", "封金挂印", "画蛇添足", "塞翁失马", "精忠报国", "甜言蜜语", "赤胆忠心", "横扫八荒", "长胜将军", "乌鹊南飞",
             "器宇不凡", "旷世奇才", "三阳开泰", "星月交辉", "九天玄武", "平步青云", "君临天下", "歃血为盟", "瑶琴三尺", "六出祁山", "汪洋自肆", "老骥伏枥", "三足鼎立",
             "妄自菲薄", "智取陈仓", "英雄远征"]

num_list3 = []
num_list4 = []

num_list5 = ["boss_pvp", "chart_pvp", "chat_pvp", "city_pvp", "consume_pvp", "convey_pvp", "five_pvp", "login",
             "ore_pvp", "pay", "pvp", "recharge_pvp", "secret_pvp", "servers_pvp", "team_pvp", "video", "web"]
num_list6 = ["boss_pvp", "chart_pvp", "chat_pvp", "city_pvp", "consume_pvp", "convey_pvp", "five_pvp", "login",
             "ore_pvp", "pay", "pvp", "recharge_pvp", "secret_pvp", "servers_pvp", "support", "team_pvp", "video",
             "web"]
for i in num_list5:
    for c in num_list6:
        if i == c:
            num_list3.append(i)
##把快玩和米趣玩服务器名称相同的放到list3
# print(num_list3)

# for j in (num_list1 + num_list2):
for j in num_list6:  ##循环遍历快玩的     如果不在相同的里面就打印出来
    if j not in num_list3:
        num_list4.append(j)
print(num_list4)

print(len(num_list4))

print(len(num_list5))
print(len(num_list6))
